<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Downloads latest Real VNC Viewer disk image and builds a package.</string>
            <key>Identifier</key>
            <string>com.github.l3nny5.pkg.RealVNCViewer</string>
            <key>Input</key>
            <dict>
                  <key>NAME</key>
                  <string>RealVNCViewer</string>
            </dict>
            <key>MinimumVersion</key>
            <string>0.6.0</string>
            <key>ParentRecipe</key>
            <string>com.github.foigus.download.RealVNCViewer</string>
            <key>Process</key>
            <array>
                  <dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>download_changed == False</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>info_path</key>
                              <string>%pathname%/VNC Viewer.app/Contents/Info.plist</string>
                              <key>plist_keys</key>
                              <dict>
                                    <key>CFBundleVersions</key>
                                    <string>version</string>
                                    <key>CFBundleIdentifier</key>
                                    <string>bundleid</string>
                              </dict>
                        </dict>
                        <key>Processor</key>
                        <string>PlistReader</string>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>PkgRootCreator</string>
                        <key>Arguments</key>
                        <dict>
                              <key>pkgroot</key>
                              <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                              <key>pkgdirs</key>
                              <dict>
                                    <key>Applications</key>
                                    <string>0775</string>
                              </dict>
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>Copier</string>
                        <key>Arguments</key>
                        <dict>
                              <key>source_path</key>
                              <string>%pathname%/VNC Viewer.app</string>
                              <key>destination_path</key>
                              <string>%pkgroot%/Applications/VNC Viewer.app</string>
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>PkgCreator</string>
                        <key>Arguments</key>
                        <dict>
                              <key>pkg_request</key>
                              <dict>
                                    <key>pkgname</key>
                                    <string>%NAME%-%version%</string>
                                    <key>version</key>
                                    <string>%version%</string>
                                    <key>id</key>
                                    <string>%bundleid%</string>
                                    <key>options</key>
                                    <string>purge_ds_store</string>
                                    <key>chown</key>
                                    <array>
                                          <dict>
                                                <key>path</key>
                                                <string>Applications</string>
                                                <key>user</key>
                                                <string>root</string>
                                                <key>group</key>
                                                <string>admin</string>
                                          </dict>
                                    </array>
                              </dict>
                        </dict>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>path_list</key>
                              <array>
                                    <string>%pkgroot%</string>
                              </array>
                        </dict>
                        <key>Processor</key>
                        <string>PathDeleter</string>
                  </dict>
            </array>
      </dict>
</plist>
