<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of TigerVNC.</string>
    <key>Identifier</key>
    <string>com.github.l3nny5.download.TigerVNC</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TigerVNC</string>
        <key>DOWNLOADPAGE_URL</key>
        <string>https://bintray.com/tigervnc/stable/tigervnc/_latestVersion</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOADPAGE_URL%</string>
                <key>re_pattern</key>
                <string>a href="(.+TigerVNC.*?\.dmg)\">TigerVNC</string>
            </dict>
        </dict>
	  <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOADPAGE_URL%</string>
                <key>re_pattern</key>
                <string>&gt;(TigerVNC.*?\.dmg)&lt;</string>
		    <key>result_output_var_name</key>
                <string>filename</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://bintray.com/%match%</string>
            </dict>
        </dict>
	  <dict>
		  <key>Arguments</key>
		  <dict>
			  <key>predicate</key>
			  <string>download_changed == False</string>
		  </dict>
		  <key>Processor</key>
		  <string>StopProcessingIf</string>
	  </dict>
	  <dict>
		  <key>Arguments</key>
		  <dict>
			  <key>input_path</key>
			  <string>%pathname%/TigerVNC*.app</string>
			  <key>requirement</key>
			  <string>anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = S5LX88A9BW</string>
		  </dict>
		  <key>Processor</key>
		  <string>CodeSignatureVerifier</string>
	  </dict>
	  <dict>
		  <key>Arguments</key>
		  <dict>
			  <key>dmg_path</key>
			  <string>%pathname%</string>
		  </dict>
		  <key>Processor</key>
		  <string>AppDmgVersioner</string>
	  </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
