<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Uses parent pkg recipe to download latest Cyberduck and import it into the JSS.</string>
            <key>Identifier</key>
            <string>com.github.l3nny5.jss.SelfService.Cyberduck</string>
            <key>Input</key>
            <dict>
                  <key>NAME</key>
                  <string>Cyberduck</string>
                  <key>CATEGORY</key>
                  <string>Apps</string>
                  <key>GROUP_NAME</key>
                  <string>SelfService%NAME%</string>
                  <key>GROUP_TEMPLATE</key>
                  <string>SmartGroupTemplate-SelfService.xml</string>
                  <key>SELFSERVICE_CATEGORY</key>
                  <string>Data Management</string>
                  <key>POLICY_TEMPLATE</key>
                  <string>PolicyTemplate-SelfService.xml</string>
                  <key>SELF_SERVICE_FEATURE_MAINPAGE</key>
                  <string>false</string>
                  <key>package_priority</key>
                  <string>10</string>
                  <key>package_boot_volume_required</key>
                  <string>False</string>
                  <key>ICON</key>
                  <string>%RECIPE_DIR%/Cyberduck.png</string>
                  <key>DESCRIPTION</key>
                  <string>Cyberduck is a open-source and easy to use FTP/FTP-TLS/SFTP browser for the Mac.</string>
            </dict>
            <key>MinimumVersion</key>
            <string>0.4.0</string>
            <key>ParentRecipe</key>
            <string>com.github.rtrouton.pkg.Cyberduck</string>
            <key>Process</key>
            <array>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>prod_name</key>
                              <string>%NAME%</string>
                              <key>category</key>
                              <string>%CATEGORY%</string>
                              <key>policy_template</key>
                              <string>%POLICY_TEMPLATE%</string>
                              <key>self_service_icon</key>
                              <string>%ICON%</string>
                              <key>self_service_description</key>
                              <string>%DESCRIPTION%</string>
                              <key>self_service_feature_mainpage</key>
                              <string>%SELF_SERVICE_FEATURE_MAINPAGE%</string>
                              <key>version</key>
                              <string>%version%</string>
                              <key>package_info</key>
                              <string>%PKGINAME% %version%</string>
                              <key>groups</key>
                              <array>
                                    <dict>
                                          <key>name</key>
                                          <string>%GROUP_NAME%</string>
                                          <key>smart</key>
                                          <true />
                                          <key>template_path</key>
                                          <string>%GROUP_TEMPLATE%</string>
                                    </dict>
                              </array>
                        </dict>
                        <key>Processor</key>
                        <string>JSSImporter</string>
                  </dict>
            </array>
      </dict>
</plist>
