<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Uses parent pkg recipe to download latest Dropbox and import it into the JSS.</string>
            <key>Identifier</key>
            <string>com.github.l3nny5.jss.SelfService.dropbox</string>
            <key>Input</key>
            <dict>
                  <key>NAME</key>
                  <string>Dropbox</string>
                  <key>CATEGORY</key>
                  <string>Apps</string>
                  <key>GROUP_NAME</key>
                  <string>SelfService%NAME%</string>
                  <key>GROUP_TEMPLATE</key>
                  <string>SmartGroupTemplate-SelfService.xml</string>
                  <key>JSS_INVENTORY_NAME</key>
                  <string>Dropbox.app</string>
                  <key>PKGINAME</key>
			<string>Atom</string>
			<key>SELFSERVICE_CATEGORY</key>
			<string>Data Management</string>
			<key>POLICY_TEMPLATE</key>
			<string>PolicyTemplate-SelfService.xml</string>
                  <key>ICON</key>
                  <string>%RECIPE_DIR%/Dropbox.png</string>
                  <key>DESCRIPTION</key>
                  <string>Dropbox is an application that creates a special Finder folder that automatically syncs online and between your computers. It allows you to both store files on Dropbox's servers and keep them up-to-date between systems.</string>
            </dict>
            <key>MinimumVersion</key>
            <string>0.4.0</string>
            <key>ParentRecipe</key>
            <string>com.github.autopkg.pkg.dropbox</string>
            <key>Process</key>
            <array>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>version</key>
                              <string>%version%</string>
                              <key>prod_name</key>
                              <string>%NAME%</string>
                              <key>jss_inventory_name</key>
                              <string>%JSS_INVENTORY_NAME%</string>
                              <key>category</key>
                              <string>%CATEGORY%</string>
                              <key>policy_category</key>
                              <string>%POLICY_TEMPLATE%</string>
                              <key>self_service_icon</key>
                              <string>%ICON%</string>
                              <key>self_service_description</key>
                              <string>%DESCRIPTION%</string>
                              <key>package_info</key>
                              <string>%PKGINAME% %version%</string>
                              <key>groups</key>
                              <array>
                                    <dict>
                                          <key>name</key>
                                          <string>%GROUP_NAME%</string>
                                          <key>smart</key>
                                          <true />
                                          <key>template_path</key>
                                          <string>%GROUP_TEMPLATE%</string>
                                    </dict>
                              </array>
                        </dict>
                        <key>Processor</key>
                        <string>JSSImporter</string>
                  </dict>
            </array>
      </dict>
</plist>
