<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
      	<key>Identifier</key>
      	<string>local.jss.EndNoteX9</string>
      	<key>Input</key>
      	<dict>
            		<key>CATEGORY</key>
            		<string>Apps</string>
            		<key>DOWNLOAD_URL</key>
            		<string>http://download.endnote.com/downloads/X9/EndNoteX9Installer.dmg</string>
            		<key>GROUP_NAME</key>
            		<string>%NAME%-update-smart</string>
            		<key>GROUP_TEMPLATE</key>
            		<string>SmartGroupTemplate-custom.xml</string>
            		<key>POLICY_CATEGORY</key>
            		<string>0-patchoo-dev</string>
            		<key>POLICY_TEMPLATE</key>
            		<string>PolicyTemplate-custom.xml</string>
            		<key>policy_action_type</key>
            		<string>Cache</string>
            		<key>package_priority</key>
            		<string>10</string>
            		<key>package_boot_volume_required</key>
            		<string>False</string>
	     </dict>
       <key>MinimumVersion</key>
	     <string>1.0.0</string>
       <key>ParentRecipe</key>
       <string>com.github.rtrouton.pkg.EndNoteX9</string>
       <key>Process</key>
       <array>
		            <dict>
                  			<key>Arguments</key>
                  			<dict>
                        				<key>category</key>
                        				<string>%CATEGORY%</string>
                        				<key>groups</key>
                        				<array>
                              					<dict>
                                    						<key>name</key>
                                    						<string>%GROUP_NAME%</string>
                                    						<key>smart</key>
                                    						<true/>
                                    						<key>template_path</key>
                                    						<string>%GROUP_TEMPLATE%</string>
                              					</dict>
                          			</array>
                        				<key>policy_category</key>
                        				<string>%POLICY_CATEGORY%</string>
                        				<key>policy_template</key>
                        				<string>%POLICY_TEMPLATE%</string>
                        				<key>prod_name</key>
                        				<string>%NAME%</string>
                        				<key>version</key>
                        				<string>%version%</string>
                        				<key>package_info</key>
                        				<string>%NAME% %version%</string>
                  			</dict>
                  			<key>Processor</key>
                  			<string>JSSImporter</string>
          		</dict>
  	   </array>
</dict>
</plist>
