<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Download the latest version of Amazon Music and creates pkg.</string>
            <key>Identifier</key>
            <string>com.github.l3nny5.pkg.AmazonMusic</string>
            <key>Input</key>
            <dict>
                  <key>NAME</key>
                  <string>Amazon Music</string>
                  <key>NAMEWITHOUTSPACES</key>
                  <string>AmazonMusic</string>
            </dict>
            <key>MinimumVersion</key>
            <string>0.2.9</string>
            <key>ParentRecipe</key>
            <string>com.github.hansen-m.download.AmazonMusic</string>
            <key>Process</key>
            <array>
                  <dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>download_changed == False</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
                  <dict>
				<key>Arguments</key>
				<dict>
					<key>dmg_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>AppDmgVersioner</string>
			</dict>
                  <dict>
                        <key>Processor</key>
                        <string>PkgRootCreator</string>
                        <key>Arguments</key>
                        <dict>
                              <key>pkgroot</key>
                              <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                              <key>pkgdirs</key>
                              <dict />
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>Copier</string>
                        <key>Arguments</key>
                        <dict>
                              <key>source_path</key>
                              <string>%pathname%/%app_name%</string>
                              <key>destination_path</key>
                              <string>%RECIPE_CACHE_DIR%/Scripts/%app_name%</string>
                              <key>overwrite</key>
                              <true />
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>FileCreator</string>
                        <key>Arguments</key>
                        <dict>
                              <key>file_path</key>
                              <string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
                              <key>file_mode</key>
                              <string>0755</string>
                              <key>file_content</key>
                              <string>#!/bin/bash

# Determine working directory
install_dir=$(dirname $0)

# Install Logitech Options
${install_dir}/"%app_name%/Contents/MacOS/osx-x86_64"

exit 0
                              </string>
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>PkgCreator</string>
                        <key>Arguments</key>
                        <dict>
                              <key>pkg_request</key>
                              <dict>
                                    <key>pkgroot</key>
                                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                                    <key>pkgname</key>
                                    <string>%NAMEWITHOUTSPACES%-%version%</string>
                                    <key>pkgtype</key>
                                    <string>flat</string>
                                    <key>id</key>
                                    <string>de.mpg.aesthetics.pkg.%NAMEWITHOUTSPACES%-%version%</string>
                                    <key>version</key>
                                    <string>%version%</string>
                                    <key>scripts</key>
                                    <string>Scripts</string>
                              </dict>
                        </dict>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>path_list</key>
                              <array>
                                    <string>%RECIPE_CACHE_DIR%/Scripts</string>
                                    <string>%pkgroot%</string>
                              </array>
                        </dict>
                        <key>Processor</key>
                        <string>PathDeleter</string>
                  </dict>
            </array>
      </dict>
</plist>
