<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Amazon Music, creates PKG, uploads it to the JSS and creates SelfService Policy.</string>
		<key>Identifier</key>
		<string>com.github.l3nny5.jss.selfservice.AmazonMusic</string>
		<key>Input</key>
		<dict>
			<key>CATEGORY</key>
			<string>Apps</string>
			<key>GROUP_NAME</key>
			<string>SelfService%NAME%</string>
			<key>GROUP_TEMPLATE</key>
			<string>SmartGroupTemplate-SelfService.xml</string>
			<key>JSS_INVENTORY_NAME</key>
			<string>Amazon Music.app</string>
			<key>NAME</key>
			<string>AmazonMusic</string>
			<key>PKGINAME</key>
			<string>Amazon Music</string>
			<key>POLICY_TEMPLATE</key>
			<string>PolicyTemplate-SelfService.xml</string>
			<key>SELFSERVICE_CATEGORY</key>
			<string>Audio</string>
			<key>SELF_SERVICE_DESCRIPTION</key>
			<string>With the Amazon Music app, you can play and download your music library, export your downloaded music to iTunes and Windows Media Player, shop the Digital Music Store, and access Prime Music (if you're an eligible Prime member).</string>
			<key>SELF_SERVICE_FEATURE_MAINPAGE</key>
			<string>false</string>
			<key>SELF_SERVICE_ICON</key>
			<string>AmazonMusic.png</string>
			<key>package_boot_volume_required</key>
			<string>false</string>
			<key>package_priority</key>
			<string>10</string>
			<key>version</key>
			<string></string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.4.0</string>
		<key>ParentRecipe</key>
		<string>com.github.l3nny5.pkg.AmazonMusic</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>category</key>
					<string>%CATEGORY%</string>
					<key>groups</key>
					<array>
						<dict>
							<key>name</key>
							<string>%GROUP_NAME%</string>
							<key>smart</key>
							<true />
							<key>template_path</key>
							<string>%GROUP_TEMPLATE%</string>
						</dict>
					</array>
					<key>package_info</key>
					<string>%PKGINAME% %version%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>prod_name</key>
					<string>%NAME%</string>
					<key>self_service_description</key>
					<string>%SELF_SERVICE_DESCRIPTION%</string>
					<key>self_service_feature_mainpage</key>
					<string>%SELF_SERVICE_FEATURE_MAINPAGE%</string>
					<key>self_service_icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
			</dict>
		</array>
	</dict>
</plist>
