<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Downloads latest VLC disk image.

                  Note that while VLC used to provide multiple Sparkle feeds for different architectures,
                  they now support only a single OS X build architecture (Intel 64-bit) starting from
                  version 2.1.0. For this reason, the appcast_url variable is now hardcoded in the recipe.
            </string>
            <key>Identifier</key>
            <string>com.github.l3nny5.download.VLC</string>
            <key>Input</key>
            <dict>
                  <key>NAME</key>
                  <string>VLC</string>
            </dict>
            <key>MinimumVersion</key>
            <string>0.4.0</string>
            <key>Process</key>
            <array>
                  <dict>
                        <key>Processor</key>
                        <string>SparkleUpdateInfoProvider</string>
                        <key>Arguments</key>
                        <dict>
                              <key>appcast_url</key>
                              <string>http://update.videolan.org/vlc/sparkle/vlc-intel64.xml</string>
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>URLDownloader</string>
                        <key>Arguments</key>
                        <dict>
                              <key>filename</key>
                              <string>%NAME%.dmg</string>
                              <key>CHECK_FILESIZE_ONLY</key>
      				<true/>
                        </dict>
                  </dict>
                  <dict>
      			<key>Arguments</key>
      			<dict>
      				<key>predicate</key>
      				<string>download_changed == False</string>
      			</dict>
      			<key>Processor</key>
      			<string>StopProcessingIf</string>
      		</dict>
                  <dict>
                        <key>Processor</key>
                        <string>EndOfCheckPhase</string>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>CodeSignatureVerifier</string>
                        <key>Arguments</key>
                        <dict>
                              <key>input_path</key>
                              <string>%pathname%/VLC.app</string>
                              <key>requirement</key>
                              <string>anchor apple generic and identifier "org.videolan.vlc" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate
                                    leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "75GAHG3SZQ")</string>
                        </dict>
                  </dict>
            </array>
      </dict>
</plist>
