<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest JAGS disk image, builds a package, uploads to the JSS and creates SelfService Policy.</string>
	<key>Identifier</key>
	<string>com.github.l3nny5.jss.selfservice.JAGS</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Apps</string>
		<key>GROUP_NAME</key>
		<string>SelfService%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplateJAGS-SelfService.xml</string>
		<key>PKGINAME</key>
		<string>JAGS</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate-SelfService.xml</string>
		<key>SELFSERVICE_CATEGORY</key>
		<string>Programming</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>JAGS is Just Another Gibbs Sampler.  It is a program for analysis of Bayesian hierarchical models using Markov Chain Monte Carlo (MCMC) simulation not wholly unlike BUGS.  JAGS was written with three aims in mind:
-To have a cross-platform engine for the BUGS language
-To be extensible, allowing users to write their own functions, distributions and samplers.
-To be a platform for experimentation with ideas in Bayesian modelling</string>
		<key>SELF_SERVICE_ICON</key>
		<string>JAGS.png</string>
		<key>package_boot_volume_required</key>
		<string>false</string>
		<key>package_priority</key>
		<string>10</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.l3nny5.pkg.JAGS</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>package_info</key>
				<string>%PKGINAME% %version%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_feature_mainpage</key>
				<string>%SELF_SERVICE_FEATURE_MAINPAGE%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
