<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Oracle Java 10 JRE and copies out the flat installer pkg within, appending the version number to the filename. (Note the version of the actual pkg id for the com.oracle.jre pkg component is still always "1.0".) To use this
            recipe, you must accept the Oracle Binary Code License Agreement for Java SE. http://www.oracle.com/technetwork/java/javase/terms/license/index.html Then, uploads to the JSS.</string>
		<key>Identifier</key>
		<string>com.github.l3nny5.jss.patchoo.OracleJava10</string>
		<key>Input</key>
		<dict>
			<key>CATEGORY</key>
			<string>Basic Software</string>
			<key>GROUP_NAME</key>
			<string>update%NAME%</string>
			<key>GROUP_TEMPLATE</key>
			<string>SmartGroupTemplateOracleJava10-patchoo.xml</string>
			<key>NAME</key>
			<string>OracleJava10</string>
			<key>PKGINAME</key>
			<string>Oracle Java</string>
			<key>PKG_ID</key>
			<string>com.oracle.jre</string>
			<key>POLICY_CATEGORY</key>
			<string>0-patchoo-dev</string>
			<key>POLICY_TEMPLATE</key>
			<string>PolicyTemplate-patchoo.xml</string>
			<key>policy_action_type</key>
			<string>Cache</string>
			<key>package_priority</key>
			<string>10</string>
			<key>package_boot_volume_required</key>
			<string>True</string>
			<key>version</key>
			<string></string>
		</dict>
		<key>MinimumVersion</key>
		<string>1</string>
		<key>ParentRecipe</key>
		<string>com.github.autopkg.pkg.OracleJava10</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>category</key>
					<string>%CATEGORY%</string>
					<key>groups</key>
					<array>
						<dict>
							<key>name</key>
							<string>%GROUP_NAME%</string>
							<key>smart</key>
							<true />
							<key>template_path</key>
							<string>%GROUP_TEMPLATE%</string>
						</dict>
					</array>
					<key>policy_category</key>
					<string>%POLICY_CATEGORY%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>prod_name</key>
					<string>%NAME%</string>
					<key>version</key>
					<string>%version%</string>
					<key>package_info</key>
					<string>%PKGINAME% %version%</string>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
			</dict>
		</array>
	</dict>
</plist>
