<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Downloads the latest verison of Logitech Control Center.</string>
            <key>Identifier</key>
            <string>com.github.l3nny5.download.logitechcontrolcenter</string>
            <key>Input</key>
            <dict>
                  <key>NAME</key>
                  <string>Logitech Control Center</string>
                  <key>COOKIE</key>
      		<string>dc:def:u=ba29f322-1c35-4e58-9164-d87afb6da971</string>
            </dict>
            <key>MinimumVersion</key>
            <string>0.3.1</string>
            <key>Process</key>
            <array>
                  <dict>
                        <key>Processor</key>
                        <string>URLTextSearcher</string>
                        <key>Arguments</key>
                        <dict>
                              <key>url</key>
                              <string>https://support.logi.com/hc/en-us/articles/360025297833</string>
                              <key>re_pattern</key>
                              <string>(?P&lt;url&gt;https:\/\/download01\.logi\.com\/web\/ftp\/pub\/techsupport\/mouse\/mac\/lcc.*?\.zip)</string>
                              <key>request_headers</key>
                              <dict>
                                    <key>Cookie</key>
                                    <string>%COOKIE%</string>
                              </dict>
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>URLDownloader</string>
                        <key>Arguments</key>
                        <dict>
                              <key>url</key>
                              <string>%url%</string>
                              <key>filename</key>
                              <string>%NAME%.zip</string>
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>Unarchiver</string>
                        <key>Arguments</key>
                        <dict>
                              <key>purge_destination</key>
                              <true />
                              <key>destination_path</key>
                              <string>%RECIPE_CACHE_DIR%/LCC</string>
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>EndOfCheckPhase</string>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>Unarchiver</string>
                        <key>Arguments</key>
                        <dict>
                              <key>archive_path</key>
                              <string>%pathname%</string>
                              <key>destination_path</key>
                              <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                              <key>purge_destination</key>
                              <true />
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>CodeSignatureVerifier</string>
                        <key>Arguments</key>
                        <dict>
                              <key>input_path</key>
                              <string>%RECIPE_CACHE_DIR%/%NAME%/LCC Installer.app</string>
                              <key>requirement</key>
                              <string>identifier "com.Logitech.Control Center.Update" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
                                    certificate leaf[subject.OU] = "QED4VVPZWA"</string>
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>PathDeleter</string>
                        <key>Arguments</key>
                        <dict>
                              <key>path_list</key>
                              <array>
                                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                              </array>
                        </dict>
                  </dict>
            </array>
      </dict>
</plist>
