<policy>
	<general>
		<name>update%PROD_NAME%</name>
		<enabled>true</enabled>
		<trigger>CHECKIN</trigger>
		<frequency>Once per computer</frequency>
		<category>
			<name>%POLICY_CATEGORY%</name>
		</category>
	</general>
	<scope>
		<!--Scope added by JSSImporter-->
	</scope>
	<package_configuration>
		<!--Package added by JSSImporter-->
	</package_configuration>
	<scripts>
		<!--Scripts added by JSSImporter-->
	</scripts>
	<self_service>
		<!--Scripts added by JSSImporter-->
	</self_service>
	<maintenance>
		<recon>true</recon>
	</maintenance>
</policy>
