<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Anaconda, uploads it to the JSS and creates SelfService Policy.</string>
		<key>Identifier</key>
		<string>com.github.l3nny5.jss.selfservice.Anaconda</string>
		<key>Input</key>
		<dict>
			<key>CATEGORY</key>
			<string>Apps</string>
			<key>GROUP_NAME</key>
			<string>SelfService%NAME%%PYTHON_MAJOR_VERSION%</string>
			<key>PKGINAME</key>
			<string>%NAME%</string>
			<key>POLICY_TEMPLATE</key>
			<string>PolicyTemplateAnaconda-SelfService.xml</string>
			<key>SELFSERVICE_CATEGORY</key>
			<string>Programming</string>
			<key>SELF_SERVICE_DESCRIPTION</key>
			<string>Anaconda is a freemium open source distribution of the Python and R programming languages for large-scale data processing, predictive analytics, and scientific computing, that aims to simplify package management and deployment.</string>
			<key>SELF_SERVICE_FEATURE_MAINPAGE</key>
			<string>false</string>
			<key>SELF_SERVICE_ICON</key>
			<string>Anaconda.png</string>
			<key>package_boot_volume_required</key>
			<string>false</string>
			<key>package_priority</key>
			<string>10</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.hansen-m.download.Anaconda</string>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>download_changed == False</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>category</key>
					<string>%CATEGORY%</string>
					<key>package_info</key>
					<string>%PKGINAME%%PYTHON_MAJOR_VERSION% %version%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>prod_name</key>
					<string>%NAME%</string>
					<key>self_service_description</key>
					<string>%SELF_SERVICE_DESCRIPTION%</string>
					<key>self_service_feature_mainpage</key>
					<string>%SELF_SERVICE_FEATURE_MAINPAGE%</string>
					<key>self_service_icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>version</key>
					<string>%version%</string>
					<key>pkg_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
			</dict>
		</array>
	</dict>
</plist>
