<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of OpenJDK 11 and builds a package. Copy of rtrouton to add pathdeleter and use com.github.l3nny5.download.OpenJDK11 parent.</string>
    <key>Identifier</key>
    <string>com.github.l3nny5.pkg.OpenJDK11</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OpenJDK 11</string>
        <key>VENDOR</key>
        <string>OpenJDK</string>
        <key>SOFTWARETITLE</key>
        <string>Java</string>
        <key>SOFTWARETYPE</key>
        <string>JDK</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.l3nny5.download.OpenJDK11</string>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                   <key>Library</key>
                   <string>0755</string>
                   <key>Library/Java</key>
                   <string>0755</string>
                   <key>Library/Java/JavaVirtualMachines</key>
                   <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/Java/JavaVirtualMachines</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
        	<key>Arguments</key>
        	<dict>
        		<key>pattern</key>
        		<string>%pkgroot%/Library/Java/JavaVirtualMachines/jdk*/Contents/Info.plist</string>
        	</dict>
        	<key>Processor</key>
        	<string>FileFinder</string>
        </dict>
        <dict>
        	<key>Arguments</key>
        	<dict>
        		<key>input_plist_path</key>
        		<string>%found_filename%</string>
        		<key>plist_version_key</key>
        		<string>CFBundleVersion</string>
        	</dict>
        	<key>Processor</key>
        	<string>Versioner</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%VENDOR%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>net.java.openjdk</string>
                    <key>scripts</key>
                    <string>Scripts</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library/Java</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library/Java/JavaVirtualMachines</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
             <key>Arguments</key>
             <dict>
                    <key>path_list</key>
                    <array>
                          <string>%pkgroot%</string>
                    </array>
             </dict>
             <key>Processor</key>
             <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>x
