<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Download recipe for the ownCloud desktop client.</string>
            <key>Identifier</key>
            <string>com.github.l3nny5.download.ownCloudDesktopClient</string>
            <key>Input</key>
            <dict>
                  <key>NAME</key>
                  <string>ownCloudDesktopClient</string>
            </dict>
            <key>MinimumVersion</key>
            <string>0.2.0</string>
            <key>Process</key>
            <array>
                  <dict>
                        <key>Processor</key>
                        <string>URLTextSearcher</string>
                        <key>Arguments</key>
                        <dict>
                              <key>url</key>
                              <string>https://owncloud.org/download/</string>
                              <key>re_pattern</key>
                              <string>href=\"(https://download.owncloud.com/desktop/stable/ownCloud-[a-z0-9\-\.]+.pkg)\"</string>
                              <key>result_output_var_name</key>
                              <string>download_url</string>
                        </dict>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>url</key>
                              <string>%download_url%</string>
                              <key>filename</key>
                              <string>%NAME%.pkg</string>
                              <key>CHECK_FILESIZE_ONLY</key>
      				<true/>
                        </dict>
                        <key>Processor</key>
                        <string>URLDownloader</string>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>EndOfCheckPhase</string>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>input_path</key>
                              <string>%pathname%</string>
                              <key>expected_authority_names</key>
                              <array>
                                    <string>Developer ID Installer: ownCloud GmbH (4AP2STM4H5)</string>
                                    <string>Developer ID Certification Authority</string>
                                    <string>Apple Root CA</string>
                              </array>
                        </dict>
                        <key>Processor</key>
                        <string>CodeSignatureVerifier</string>
                  </dict>
            </array>
      </dict>
</plist>
