<policy>
	<general>
		<name>SelfService%PROD_NAME%</name>
		<enabled>true</enabled>
		<frequency>Ongoing</frequency>
	</general>
	<scope>
		<all_computers>true</all_computers>
	</scope>
	<package_configuration>
		<!--Package added by JSSImporter-->
	</package_configuration>
	<scripts>
		<!--Scripts added by JSSImporter-->
	</scripts>
	<self_service>
		<use_for_self_service>true</use_for_self_service>
		<install_button_text>Install %VERSION%</install_button_text>
		<self_service_display_name>%PKGINAME%</self_service_display_name>
		<reinstall_button_text>Reinstall %VERSION%</reinstall_button_text>
		<self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
		<feature_on_main_page>%SELF_SERVICE_FEATURE_MAINPAGE%</feature_on_main_page>
		<self_service_categories>
			<category>
				<name>%SELFSERVICE_CATEGORY%</name>
				<display_in>true</display_in>
				<feature_in>false</feature_in>
			</category>
		</self_service_categories>
	</self_service>
	<maintenance>
		<recon>true</recon>
	</maintenance>
</policy>
