<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Downloads the latest release PKG copy of the Rocket Chat Client (RocketChat.Electron) from Github. Set PRERELEASE to a non-empty string to download prereleases, either via Input in an override or via the -k option, i.e.: `-k
                  PRERELEASE=yes` copy of com.github.apizz.pkg.RocketChatClient recipe to correct</string>
            <key>Identifier</key>
            <string>com.github.l3nny5.pkg.RocketChatClient</string>
            <key>Input</key>
            <dict>
                  <key>NAME</key>
                  <string>Rocket.Chat</string>
                  <key>PRERELEASE</key>
                  <string></string>
            </dict>
            <key>MinimumVersion</key>
            <string>0.6.1</string>
            <key>Process</key>
            <array>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>github_repo</key>
                              <string>RocketChat/Rocket.Chat.Electron</string>
                              <key>include_preleases</key>
                              <string>%PRERELEASE%</string>
                        </dict>
                        <key>Processor</key>
                        <string>GitHubReleasesInfoProvider</string>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>asset_regex</key>
                              <string>rocketchat-%version%\.pkg</string>
                              <key>github_repo</key>
                              <string>RocketChat/Rocket.Chat.Electron</string>
                              <key>include_preleases</key>
                              <string>%PRERELEASE%</string>
                        </dict>
                        <key>Processor</key>
                        <string>GitHubReleasesInfoProvider</string>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>filename</key>
                              <string>%NAME%-%version%.pkg</string>
                        </dict>
                        <key>Processor</key>
                        <string>URLDownloader</string>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>EndOfCheckPhase</string>
                  </dict>
                  <dict>
      			<key>Arguments</key>
      			<dict>
      				<key>predicate</key>
      				<string>download_changed == False</string>
      			</dict>
      			<key>Processor</key>
      			<string>StopProcessingIf</string>
      		</dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>input_path</key>
                              <string>%pathname%/%NAME%.app</string>
                              <key>expected_authority_names</key>
                              <array>
                                    <string>Developer ID Installer: Rocket.Chat Technologies Corp. (S6UPZG7ZR3)</string>
                                    <string>Developer ID Certification Authority</string>
                                    <string>Apple Root CA</string>
                              </array>
                        </dict>
                        <key>Processor</key>
                        <string>CodeSignatureVerifier</string>
                  </dict>
            </array>
      </dict>
</plist>
