<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Downloads EndNote X9 disk image and builds a package, then uploads to the JSS.</string>
            <key>Identifier</key>
            <string>com.github.l3nny5.jss.patchoo.EndNoteX9</string>
            <key>Input</key>
            <dict>
                  <key>CATEGORY</key>
                  <string>Apps</string>
                  <key>GROUP_NAME</key>
                  <string>update%NAME%</string>
                  <key>GROUP_TEMPLATE</key>
                  <string>SmartGroupTemplate-patchoo.xml</string>
                  <key>JSS_INVENTORY_NAME</key>
      		<string>EndNote X9.app</string>
                  <key>NAME</key>
                  <string>EndNoteX9</string>
                  <key>PKGINAME</key>
                  <string>EndNote X9</string>
                  <key>POLICY_CATEGORY</key>
                  <string>0-patchoo-dev</string>
                  <key>POLICY_TEMPLATE</key>
                  <string>PolicyTemplate-patchoo.xml</string>
                  <key>policy_action_type</key>
                  <string>Cache</string>
                  <key>package_priority</key>
                  <string>10</string>
                  <key>package_boot_volume_required</key>
                  <string>True</string>
            </dict>
            <key>MinimumVersion</key>
            <string>1.0.0</string>
            <key>ParentRecipe</key>
            <string>com.github.rtrouton.pkg.EndNoteX9</string>
            <key>Process</key>
            <array>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>category</key>
                              <string>%CATEGORY%</string>
                              <key>groups</key>
                              <array>
                                    <dict>
                                          <key>name</key>
                                          <string>%GROUP_NAME%</string>
                                          <key>smart</key>
                                          <true/>
                                          <key>template_path</key>
                                          <string>%GROUP_TEMPLATE%</string>
                                    </dict>
                              </array>
                              <key>jss_inventory_name</key>
      				<string>%JSS_INVENTORY_NAME%</string>
                              <key>policy_category</key>
                              <string>%POLICY_CATEGORY%</string>
                              <key>policy_template</key>
                              <string>%POLICY_TEMPLATE%</string>
                              <key>prod_name</key>
                              <string>%NAME%</string>
                              <key>version</key>
                              <string>%version%</string>
                              <key>package_info</key>
                              <string>%PKGINAME% %version%</string>
                        </dict>
                        <key>Processor</key>
                        <string>JSSImporter</string>
                  </dict>
            </array>
      </dict>
</plist>
