<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Downloads Adobe Flash Player installer and extracts the embedded package.</string>
            <key>Identifier</key>
            <string>com.github.l3nny5.pkg.FlashPlayer</string>
            <key>Input</key>
            <dict>
                  <key>NAME</key>
                  <string>AdobeFlashPlayer</string>
            </dict>
            <key>MinimumVersion</key>
            <string>0.6.0</string>
            <key>ParentRecipe</key>
            <string>com.github.autopkg.download.FlashPlayer</string>
            <key>Process</key>
            <array>
                  <dict>
                        <key>Comment</key>
                        <string>Get Adobe Flash version from the pkg</string>
                        <key>Processor</key>
                        <string>Versioner</string>
                        <key>Arguments</key>
                        <dict>
                              <key>input_plist_path</key>
                              <string>%pathname%/Install Adobe Flash Player.app/Contents/Info.plist</string>
                              <key>plist_version_key</key>
                              <string>CFBundleVersion</string>
                        </dict>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>pkgdirs</key>
                              <dict />
                              <key>pkgroot</key>
                              <string>%RECIPE_CACHE_DIR%/Scripts</string>
                        </dict>
                        <key>Processor</key>
                        <string>PkgRootCreator</string>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>pkgdirs</key>
                              <dict />
                              <key>pkgroot</key>
                              <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                        </dict>
                        <key>Processor</key>
                        <string>PkgRootCreator</string>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>destination_path</key>
                              <string>%RECIPE_CACHE_DIR%/Scripts/%NAME%.pkg</string>
                              <key>overwrite</key>
                              <true />
                              <key>source_path</key>
                              <string>%pathname%/Install Adobe Flash Player.app/Contents/Resources/Adobe Flash Player.pkg</string>
                        </dict>
                        <key>Processor</key>
                        <string>Copier</string>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>file_content</key>
                              <string>#!/bin/bash

# Determine working directory
install_dir=$(dirname $0)

# Install Logitech Options
/usr/sbin/installer -dumplog -verbose -pkg ${install_dir}/"AdobeFlashPlayer.pkg" -target "$3"

# Set Update Settings to not inform
if [ -d "$3/Library/Application Support/Macromedia" ]; then
#do nothing
else
mkdir "/Library/Application Support/Macromedia"
fi
{
echo "AutoUpdateDisable=1"
echo "SilentAutoUpdateEnable=0"
} > '/Library/Application Support/Macromedia/mms.cfg'

exit 0
                              </string>
                              <key>file_mode</key>
                              <string>0755</string>
                              <key>file_path</key>
                              <string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
                        </dict>
                        <key>Processor</key>
                        <string>FileCreator</string>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>pkg_request</key>
                              <dict>
                                    <key>id</key>
                                    <string>de.mpg.ae.%NAME%-%version%</string>
                                    <key>pkgname</key>
                                    <string>%NAME%-%version%</string>
                                    <key>pkgroot</key>
                                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                                    <key>pkgtype</key>
                                    <string>flat</string>
                                    <key>scripts</key>
                                    <string>Scripts</string>
                                    <key>version</key>
                                    <string>%version%</string>
                              </dict>
                        </dict>
                        <key>Processor</key>
                        <string>PkgCreator</string>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>path_list</key>
                              <array>
                                    <string>%RECIPE_CACHE_DIR%/Scripts</string>
                                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                              </array>
                        </dict>
                        <key>Processor</key>
                        <string>PathDeleter</string>
                  </dict>
            </array>
      </dict>
</plist>
