<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uses parent pkg recipe to download latest Dropbox and import it into the JSS.</string>
	<key>Identifier</key>
	<string>com.github.l3nny5.jss.Dropbox</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Apps</string>
		<key>GROUP_NAME_PATCHOO</key>
		<string>update%NAME%</string>
		<key>GROUP_NAME_SELFSERVICE</key>
		<string>SelfService%NAME%</string>
		<key>GROUP_TEMPLATE_PATCHOO</key>
		<string>SmartGroupTemplate-patchoo.xml</string>
		<key>GROUP_TEMPLATE_SELFSERVICE</key>
		<string>SmartGroupTemplate-SelfService.xml</string>
		<key>DESCRIPTION</key>
		<string>Dropbox is an application that creates a special Finder folder that automatically syncs online and between your computers. It allows you to both store files on Dropbox's servers and keep them up-to-date between systems.</string>
		<key>ICON</key>
		<string>Dropbox.png</string>
		<key>JSS_INVENTORY_NAME</key>
		<string>Dropbox.app</string>
		<key>NAME</key>
		<string>Dropbox</string>
		<key>PKGINAME</key>
		<string>Dropbox</string>
		<key>POLICY_CATEGORY</key>
		<string>0-patchoo-dev</string>
		<key>POLICY_TEMPLATE_PATCHOO</key>
		<string>PolicyTemplate-patchoo.xml</string>
		<key>POLICY_TEMPLATE_SELFSERVICE</key>
		<string>PolicyTemplate-SelfService.xml</string>
		<key>SELFSERVICE_CATEGORY</key>
		<string>Data Management</string>
		<key>SELF_SERVICE_FEATURE_MAINPAGE</key>
		<string>false</string>
		<key>package_boot_volume_required</key>
		<string>False</string>
		<key>package_priority</key>
		<string>10</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.dropbox</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>download_changed == False</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME_PATCHOO%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE_PATCHOO%</string>
					</dict>
				</array>
				<key>jss_inventory_name</key>
				<string>%JSS_INVENTORY_NAME%</string>
				<key>package_info</key>
				<string>%PKGINAME% %version%</string>
				<key>policy_action_type</key>
				<string>Cache</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE_PATCHOO%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME_SELFSERVICE%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE_SELFSERVICE%</string>
					</dict>
				</array>
				<key>jss_inventory_name</key>
				<string>%JSS_INVENTORY_NAME%</string>
				<key>package_info</key>
				<string>%PKGINAME% %version%</string>
				<key>policy_action_type</key>
				<string>Install</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE_SELFSERVICE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%ICON%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
