<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Downloads Firefox disk image and builds a package. The installer package includes a preinstall script that will check for an existing Firefox.app in /Applications and remove it if found.
                  Values for FIREFOX_BUILD correspond to directories here: http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/
                  Some useful values are: 'latest', 'latest-10.0esr', 'latest-esr', 'latest-3.6', 'latest-beta'
                  LOCALE corresponds to directories at http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/$FIREFOX_BUILD/mac/
                  Examples include 'en-US', 'de', 'ja-JP-mac', 'sv-SE', and 'zh-TW'
                  No idea if all Firefox builds are available in all the same localizations, so you may need to verify that any particular
                  combination is offered. Copy of rtrouton recipe, but adds a postinstall script to deactivate autoupdate.</string>
            <key>Identifier</key>
            <string>com.github.l3nny5.pkg.Firefox</string>
            <key>Input</key>
            <dict>
                  <key>NAME</key>
                  <string>Firefox</string>
            </dict>
            <key>MinimumVersion</key>
            <string>0.2.0</string>
            <key>ParentRecipe</key>
            <string>com.github.autopkg.download.firefox-rc-en_US</string>
            <key>Process</key>
            <array>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>predicate</key>
                              <string>download_changed == False</string>
                        </dict>
                        <key>Processor</key>
                        <string>StopProcessingIf</string>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>AppDmgVersioner</string>
                        <key>Arguments</key>
                        <dict>
                              <key>dmg_path</key>
                              <string>%pathname%</string>
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>PkgRootCreator</string>
                        <key>Arguments</key>
                        <dict>
                              <key>pkgroot</key>
                              <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                              <key>pkgdirs</key>
                              <dict>
                                    <key>Applications</key>
                                    <string>0775</string>
                              </dict>
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>Copier</string>
                        <key>Arguments</key>
                        <dict>
                              <key>source_path</key>
                              <string>%pathname%/Firefox.app</string>
                              <key>destination_path</key>
                              <string>%pkgroot%/Applications/Firefox.app</string>
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>PkgCreator</string>
                        <key>Arguments</key>
                        <dict>
                              <key>pkgname</key>
                              <string>%NAME%-%version%</string>
                              <key>pkg_request</key>
                              <dict>
                                    <key>pkgdir</key>
                                    <string>%RECIPE_CACHE_DIR%</string>
                                    <key>id</key>
                                    <string>org.mozilla.firefox.pkg</string>
                                    <key>options</key>
                                    <string>purge_ds_store</string>
                                    <key>scripts</key>
                                    <string>Scripts</string>
                                    <key>chown</key>
                                    <array>
                                          <dict>
                                                <key>path</key>
                                                <string>Applications</string>
                                                <key>user</key>
                                                <string>root</string>
                                                <key>group</key>
                                                <string>admin</string>
                                          </dict>
                                    </array>
                              </dict>
                        </dict>
                  </dict>
            </array>
      </dict>
</plist>
