<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Spotify dmg and creates a pkg from it. Copy of com.github.homebysix.pkg.Spotify with small changes</string>
		<key>Identifier</key>
		<string>com.github.l3nny5.pkg.Spotify</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Spotify</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.github.autopkg.download.Spotify</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>dmg_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>AppDmgVersioner</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>split_on</key>
					<string>.g</string>
				</dict>
				<key>Processor</key>
				<string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>0775</string>
					</dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/Applications/Spotify.app</string>
					<key>source_path</key>
					<string>%pathname%/Spotify.app</string>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
					<key>file_path</key>
					<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
					<key>file_mode</key>
					<string>0755</string>
					<key>file_content</key>
					<string>#!/bin/bash

#
# spotify-fix-permissions-postinstall.sh
# Source: https://gist.github.com/hjuutilainen/dc6e8b77af0dced03271ef1a10471cb0
#

SPOTIFY_PATH="/Applications/Spotify.app"

if [[ ! -d "${SPOTIFY_PATH}" ]]; then
echo "File not found: ${SPOTIFY_PATH}"
exit 1
fi

echo "Fixing Spotify permissions..."

# Find every file executable by its owner
IFS=$'\n'
for EXECUTABLE in $(/usr/bin/find "${SPOTIFY_PATH}" -perm -u=x -type f); do
PERMISSIONS=$(/usr/bin/stat -f "%Op" "${EXECUTABLE}")
if [[ ${PERMISSIONS} != "100755" ]]; then
/bin/chmod 755 "${EXECUTABLE}"
fi
done

exit 0
					</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>chown</key>
						<array>
							<dict>
								<key>group</key>
								<string>admin</string>
								<key>path</key>
								<string>Applications</string>
								<key>user</key>
								<string>root</string>
							</dict>
						</array>
						<key>id</key>
						<string>de.mpg.aesthetics.pkg.%NAME%-%version%</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>pkgdir</key>
						<string>%RECIPE_CACHE_DIR%</string>
						<key>scripts</key>
						<string>Scripts</string>
					</dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
				</dict>
				<key>Processor</key>
				<string>PkgCreator</string>
			</dict>
		</array>
	</dict>
</plist>
