<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Downloads MuseScore and creates a package installer for the app.</string>
            <key>Identifier</key>
            <string>com.github.l3nny5.pkg.MuseScore</string>
            <key>Input</key>
            <dict />
            <key>MinimumVersion</key>
            <string>1.0.0</string>
            <key>ParentRecipe</key>
            <string>com.github.jazzace.download.MuseScore</string>
            <key>Process</key>
            <array>
                  <dict>
                        <key>Processor</key>
                        <string>AppPkgCreator</string>
                        <key>Arguments</key>
                        <dict>
                              <key>pkg_path</key>
                              <string>%RECIPE_CACHE_DIR%/MuseScore-%version%.pkg</string>
                        </dict>
                  </dict>
            </array>
      </dict>
</plist>
