<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Downloads the latest version of MuseScore.
                  (Due to the use of multiple download mirrors, this recipe only checks to see if the filesize has changed.)</string>
            <key>Identifier</key>
            <string>com.github.l3nny5.download.MuseScore</string>
            <key>Input</key>
            <dict>
                  <key>NAME</key>
                  <string>MuseScore 3</string>
            </dict>
            <key>MinimumVersion</key>
            <string>0.2.9</string>
            <key>Process</key>
            <array>
                  <dict>
                        <key>Processor</key>
                        <string>URLTextSearcher</string>
                        <key>Arguments</key>
                        <dict>
                              <key>url</key>
                              <string>https://musescore.org/en/download/musescore.dmg</string>
                              <key>re_pattern</key>
                              <string>(?P&lt;url&gt;https:.*\.*\MuseScore-(?P&lt;version&gt;[0-9.]*)\.dmg)</string>
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>URLDownloader</string>
                        <key>Arguments</key>
                        <dict>
                              <key>CHECK_FILESIZE_ONLY</key>
                              <true />
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>EndOfCheckPhase</string>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>CodeSignatureVerifier</string>
                        <key>Arguments</key>
                        <dict>
                              <key>input_path</key>
                              <string>%pathname%/MuseScore*.app</string>
                              <key>requirement</key>
                              <string>identifier "org.musescore.MuseScore" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate
                                    leaf[subject.OU] = "6EPAF2X3PR"</string>
                        </dict>
                  </dict>
            </array>
      </dict>
</plist>
