<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Uses parent download recipe to download the latest unlicensed Microsoft Office 2016 installer package.</string>
		<key>Identifier</key>
		<string>com.github.l3nny5.pkg.MicrosoftOffice2016Suite</string>
		<key>Input</key>
		<dict />
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.l3nny5.download.MicrosoftOffice2016Suite</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>download_changed == False</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>PkgCopier</string>
			</dict>
		</array>
	</dict>
</plist>
