<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Downloads the latest release PKG copy of the Rocket Chat Client (RocketChat.Electron) from Github. Set PRERELEASE to a non-empty string to download prereleases, either via Input in an override or via the -k option, i.e.: `-k
                  PRERELEASE=yes` copy of com.github.apizz.pkg.RocketChatClient recipe to correct</string>
            <key>Identifier</key>
            <string>com.github.l3nny5.download.Atom</string>
            <key>Input</key>
            <dict>
                  <key>NAME</key>
                  <string>Atom</string>
            </dict>
            <key>MinimumVersion</key>
            <string>0.6.1</string>
            <key>Process</key>
            <array>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>github_repo</key>
                              <string>atom/atom</string>
                        </dict>
                        <key>Processor</key>
                        <string>GitHubReleasesInfoProvider</string>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>asset_regex</key>
                              <string>atom-mac.zip</string>
                              <key>github_repo</key>
                              <string>atom/atom</string>
                        </dict>
                        <key>Processor</key>
                        <string>GitHubReleasesInfoProvider</string>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>filename</key>
                              <string>%NAME%-%version%.zip</string>
                        </dict>
                        <key>Processor</key>
                        <string>URLDownloader</string>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>EndOfCheckPhase</string>
                  </dict>
                  <dict>
      			<key>Arguments</key>
      			<dict>
      				<key>predicate</key>
      				<string>download_changed == False</string>
      			</dict>
      			<key>Processor</key>
      			<string>StopProcessingIf</string>
      		</dict>
            </array>
      </dict>
</plist>
