<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
      <dict>
            <key>Description</key>
            <string>Downloads the latest release of Atom from Github.</string>
            <key>Identifier</key>
            <string>com.github.l3nny5.download.Atom</string>
            <key>Input</key>
            <dict>
                  <key>NAME</key>
                  <string>Atom</string>
            </dict>
            <key>MinimumVersion</key>
            <string>0.6.1</string>
            <key>Process</key>
            <array>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>github_repo</key>
                              <string>atom/atom</string>
                        </dict>
                        <key>Processor</key>
                        <string>GitHubReleasesInfoProvider</string>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>asset_regex</key>
                              <string>atom-mac.zip</string>
                              <key>github_repo</key>
                              <string>atom/atom</string>
                        </dict>
                        <key>Processor</key>
                        <string>GitHubReleasesInfoProvider</string>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>filename</key>
                              <string>%NAME%.zip</string>
                        </dict>
                        <key>Processor</key>
                        <string>URLDownloader</string>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>EndOfCheckPhase</string>
                  </dict>
                  <dict>
                        <key>Arguments</key>
                        <dict>
                              <key>predicate</key>
                              <string>download_changed == False</string>
                        </dict>
                        <key>Processor</key>
                        <string>StopProcessingIf</string>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>Unarchiver</string>
                        <key>Arguments</key>
                        <dict>
                              <key>archive_path</key>
                              <string>%pathname%</string>
                              <key>destination_path</key>
                              <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                              <key>purge_destination</key>
                              <true />
                        </dict>
                  </dict>
                  <dict>
                        <key>Processor</key>
                        <string>CodeSignatureVerifier</string>
                        <key>Arguments</key>
                        <dict>
                              <key>input_path</key>
                              <string>%RECIPE_CACHE_DIR%/%NAME%/Atom.app</string>
                              <key>requirement</key>
                              <string>identifier "com.github.atom" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate
                                    leaf[subject.OU] = VEKTX9H2N7</string>
                              <key>strict_verification</key>
                              <true />
                        </dict>
                  </dict>
            </array>
      </dict>
</plist>
