<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads latest Omnidisksweeper disk image, builds a package, uploads to the JSS and creates SelfService Policy.</string>
		<key>Identifier</key>
		<string>com.github.l3nny5.jss.selfservice.Omnidisksweeper</string>
		<key>Input</key>
		<dict>
			<key>CATEGORY</key>
			<string>Apps</string>
			<key>GROUP_NAME</key>
			<string>SelfService%NAME%</string>
			<key>GROUP_TEMPLATE</key>
			<string>SmartGroupTemplateOmnidisksweeper-SelfService.xml</string>
			<key>JSS_INVENTORY_NAME</key>
			<string>OmniDiskSweeper.app</string>
			<key>PKGINAME</key>
			<string>OmniDiskSweeper</string>
			<key>SELFSERVICE_CATEGORY</key>
			<string>Communication</string>
			<key>MINIMUMOSVERSION</key>
			<string>10.13</string>
			<key>POLICY_TEMPLATE</key>
			<string>PolicyTemplate-SelfService.xml</string>
			<key>SELF_SERVICE_DESCRIPTION</key>
			<string>OmniDiskSweeper is really great at what it does: showing you the files on your drive, in descending order by size, and letting you decide what to do with them. Delete away, but exercise caution: OmniDiskSweeper does not perform any safety checks before deleting files!</string>
			<key>SELF_SERVICE_ICON</key>
			<string>OmniDiskSweeper.png</string>
			<key>SELF_SERVICE_FEATURE_MAINPAGE</key>
			<string>true</string>
			<key>version</key>
			<string></string>
			<key>package_priority</key>
			<string>10</string>
			<key>package_boot_volume_required</key>
			<string>false</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.luisgiraldo.pkg.omnidisksweeper</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>download_changed == False</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>category</key>
					<string>%CATEGORY%</string>
					<key>groups</key>
					<array>
						<dict>
							<key>name</key>
							<string>%GROUP_NAME%</string>
							<key>smart</key>
							<true />
							<key>template_path</key>
							<string>%GROUP_TEMPLATE%</string>
						</dict>
					</array>
					<key>jss_inventory_name</key>
					<string>%JSS_INVENTORY_NAME%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>prod_name</key>
					<string>%NAME%</string>
					<key>self_service_description</key>
					<string>%SELF_SERVICE_DESCRIPTION%</string>
					<key>self_service_icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>self_service_feature_mainpage</key>
					<string>%SELF_SERVICE_FEATURE_MAINPAGE%</string>
					<key>version</key>
					<string>%version%</string>
					<key>package_info</key>
					<string>%PKGINAME% %version%</string>
					<key>minimumosversion</key>
					<string>%MINIMUMOSVERSION%</string>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
			</dict>
		</array>
	</dict>
</plist>
