<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Creates PKG of OsiriX Lite (you have to download it first and put it into a folder)</string>
		<key>Identifier</key>
		<string>com.github.l3nny5.pkg.OsiriX</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>OsiriXLite</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.51</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PackageRequired</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Copier</string>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%PKG%/OsiriX Lite Installer.app/Contents/Resources</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/Resources</string>
					<key>overwrite</key>
					<true />
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%RECIPE_CACHE_DIR%/Resources/OsiriXLite.zip</string>
					<key>purge_destination</key>
					<true />
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%RECIPE_CACHE_DIR%/Resources/OsiriXQuickLookPlugin.qlgenerator.zip</string>
					<key>purge_destination</key>
					<false />
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</dict>
			</dict>
			<dict>
                        <key>Arguments</key>
                        <dict>
                              <key>input_plist_path</key>
                              <string>%RECIPE_CACHE_DIR%/unpack/OsiriX Lite Installer.app/Contents/Info.plist</string>
                              <key>plist_version_key</key>
                              <string>CFBundleShortVersionString</string>
                        </dict>
                        <key>Processor</key>
                        <string>Versioner</string>
                  </dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>0775</string>
					</dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/Applications/OsiriX Lite.app</string>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/OsiriX Lite.app</string>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/Library/QuickLook/OsiriXQuickLookPlugin.qlgenerator</string>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/OsiriXQuickLookPlugin.qlgenerator</string>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>chown</key>
						<array>
							<dict>
								<key>group</key>
								<string>admin</string>
								<key>path</key>
								<string>Applications</string>
								<key>user</key>
								<string>root</string>
							</dict>
						</array>
						<key>id</key>
						<string>com.rossetantoine.osirix</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>pkgname</key>
						<string>%NAME%-%version%</string>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>PkgCreator</string>
			</dict>
		</array>
	</dict>
</plist>
